In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    'city':['mumbai','delhi','bangalore'],
    'temperature':[32,45,30],
    'humidity':[80,60,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [3]:
us_weather = pd.DataFrame({
    'city':['new york','Chicago','orlando'],
    'temperature':[21,14,35],
    'humidity':[68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   Chicago           14        65
2   orlando           35        75

In [6]:
df = pd.concat([india_weather,us_weather],ignore_index=True)

In [7]:
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    Chicago           14        65
5    orlando           35        75

In [8]:
df = pd.concat([india_weather,us_weather], keys=["india","us"])

In [9]:
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
us    0   new york           21        68
      1    Chicago           14        65
      2    orlando           35        75

In [10]:
df.loc['us']

       city  temperature  humidity
0  new york           21        68
1   Chicago           14        65
2   orlando           35        75

In [12]:
temperature_df = pd.DataFrame({
        'city':['mumbai','delhi','bangalore'],
    'temperature':[32,45,30]
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [13]:
windspeed_df = pd.DataFrame({
        'city':['mumbai','delhi','bangalore'],
    'windspeed_df':[7,12,9]
})
windspeed_df

        city  windspeed_df
0     mumbai             7
1      delhi            12
2  bangalore             9

In [16]:
df = pd.concat([temperature_df,windspeed_df],axis = 1)

In [17]:
df

        city  temperature       city  windspeed_df
0     mumbai           32     mumbai             7
1      delhi           45      delhi            12
2  bangalore           30  bangalore             9